app/controllers/api/lists_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 0], ["LIMIT", 1]]
---
    def show
        @list = current_user.lists.find_by(id: params[:id])

INSERT INTO "lists" ("user_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["title", "hi"], ["created_at", "2020-11-22 01:58:24.185267"], ["updated_at", "2020-11-22 01:58:24.185267"]]
---
    def create
        # debugger
        @list = List.new(list_params)
        @list.user_id = current_user.id;

        if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 0], ["LIMIT", 1]]
UPDATE "lists" SET "title" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["title", "why"], ["updated_at", "2020-11-23 19:12:31.862731"], ["id", 35]]
---
    def update
        @list = current_user.list.find_by(id: params[:id])

        if @list.update_attributes(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]
---
    def destroy
        list = current_user.lists.find_by(id: params[:id])
        list.destroy