app/controllers/api/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 45]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def index
        # debugger
        @tasks = List.find(params[:list_id]).tasks

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @task = List.find(params[:list_id]).Task.find(params[:id])

INSERT INTO "tasks" ("list_id", "body", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["list_id", 47], ["body", "hihihihihihihi testing"], ["completed", false], ["created_at", "2020-11-25 20:18:51.490643"], ["updated_at", "2020-11-25 20:18:51.490643"]]
---
    def create
        @task = Task.new(task_params)
        @task.list_id = params[:list_id]
        # debugger
        if @task.save

SELECT  "tasks".* FROM "tasks" INNER JOIN "lists" ON "tasks"."list_id" = "lists"."id" WHERE "lists"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 0], ["LIMIT", 1]]
---
    def update
        @task = current_user.tasks.find_by(id: params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 47]]
---
    def destroy
        # debugger
        # @task = List.find(params[:list_id]).tasks.find(params[:id])
        @task = Task.find(params[:id])
        @task.destroy