app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    # debugger
    if @user.save