app/views/api/users/show.json.jbuilder

json.extract! @user, :id, :username, :email, :last_name, :first_name
json.list_ids @user.lists.pluck(:id)
---
SELECT "lists"."id" FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 1]]